Repository: e404r/woocommerce_TBC_Installment
Catalog: langs/wootbcin-*.po
Languages: ka_ge

source: Add a TBC Bank installment plan to your site
ka_ge: საიტზე TBC ბანკის განვადების ჩართვა

source: Buy in installments
ka_ge: განვადებით შეძენა

source: Buy products with TBC installment.
ka_ge: შეიძინეთ პროდუქტები TBC განვადებით.

source: Configure
ka_ge: კონფიგურაცია

source: Description
ka_ge: აღწერა

source: Inclusion of TBC installment
ka_ge: TBC განვადების ჩართვა

source: Payment method description that the customer will see on your checkout.
ka_ge: გადახდის მეთოდის აღწერა, რომელსაც მომხმარებელი დაინახავს გადახდის დროს.

source: TBC installment
ka_ge: TBC განვადება

source: This controls the title for the payment method the customer sees during checkout.
ka_ge: ეს აკონტროლებს გადახდის მეთოდის სათაურს, რომელსაც მომხმარებელი ხედავს გადახდის დროს.

source: Title
ka_ge: სათაური

source: Turning ON / OFF
ka_ge: ჩართვა / გამორთვა
